# TableCellStyle Constructor (TableCellStyle) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyle Constructor (TableCellStyle)
TableCellStyle Class See Also
---
Constructs a new copy of the input TableCellStyle object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TableCellStyle(
	TableCellStyle other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As TableCellStyle _
)
```

Visual C++
---
```text
public:
TableCellStyle(
	TableCellStyle^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..TableCellStyle
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TableCellStyle Class
TableCellStyle Overload
Autodesk.Revit.DB Namespace